kernel/kernel-debug-with-kgtp.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Kernel debug with kgtp on android</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-11-03 11:14:26 CST"/>
<meta name="author" content="Bian Jiang"/>
<meta name="description" content=""/>
<meta name="keywords" content="Android, Kernel, gdb, KGTP, tracepoints"/>



</head>
<body>
<div id="content">
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="http://wifihack.net"> UP </a>
 |
 <a accesskey="H" href="http://wifihack.net"> HOME </a>
</div>

<h1 class="title">Kernel debug with kgtp on android</h1>


<p>
KGTP is a realtime and lightweight Linux Kernel GDB debugger and tracer.
It makes Linux Kernel supply a GDB remote debug interface. Then GDB in current machine or remote machine can debug and trace Linux through GDB tracepoint without stopping the Linux Kernel.
And even if the board doesn't have GDB on it and doesn't have interface for remote debug. It can debug the Linux Kernel using offline debug.
Now, it supports X86-32, X86-64, MIPS and ARM.
</p>
<p>
This article describes how to use kgtp debug linux kernel on android.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Kernel Building </a></li>
<li><a href="#sec-2">2 Building KGTP </a>
<ul>
<li><a href="#sec-2_1">2.1 Config KGTP Makefile </a></li>
<li><a href="#sec-2_2">2.2 error: 'GTP<sub>VAR</sub><sub>RDTSC</sub><sub>ID'</sub> undeclared(latest version fixed By: teawater ) </a></li>
</ul>
</li>
<li><a href="#sec-3">3 Complie and Install KGTP </a></li>
<li><a href="#sec-4">4 KGTP Running On Android </a></li>
<li><a href="#sec-5">5 Host PC </a></li>
<li><a href="#sec-6">6 Good luck, Happy Hacking&hellip; </a></li>
<li><a href="#sec-7">7 Very grateful for teawater </a></li>
<li><a href="#sec-8">8 References </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Kernel Building </h2>
<div class="outline-text-2" id="text-1">




<pre class="example"> General setup  ---&gt; 
     [ * ] Prompt for development and/or incomplete code/drivers
     [ * ] Kprobe
Kernel hacking  ---&gt;
     [ * ] Kernel debugging
     [ * ]     Collect scheduler statistics
     [ * ] Compile the kernel with debug info
     [ * ] Compile the kernel with frame pointers
</pre>




</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Building KGTP </h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2_1" class="outline-3">
<h3 id="sec-2_1"><span class="section-number-3">2.1</span> Config KGTP Makefile </h3>
<div class="outline-text-3" id="text-2_1">




<pre class="example">KERNELDIR := /work/vc1000/src/kernel-vc1000-2.3
ARCH=arm
CROSS_COMPILE=/usr/local/arm/arm-2009q3/bin/arm-none-linux-gnueabi-
</pre>



</div>

</div>

<div id="outline-container-2_2" class="outline-3">
<h3 id="sec-2_2"><span class="section-number-3">2.2</span> error: 'GTP<sub>VAR</sub><sub>RDTSC</sub><sub>ID'</sub> undeclared(latest version fixed By: <a href="http://twitter.com/teawater">teawater</a> ) </h3>
<div class="outline-text-3" id="text-2_2">





<pre class="example">  CC [M]  /home/border/work/kernel/kgtp/trunk/gtp.o
/home/border/work/kernel/kgtp/trunk/gtp.c: In function 'gtp_gdbrsp_qtv':
/home/border/work/kernel/kgtp/trunk/gtp.c:6318: error: 'GTP_VAR_RDTSC_ID' undeclared (first use in this function)
/home/border/work/kernel/kgtp/trunk/gtp.c:6318: error: (Each undeclared identifier is reported only once
/home/border/work/kernel/kgtp/trunk/gtp.c:6318: error: for each function it appears in.)
/home/border/work/kernel/kgtp/trunk/gtp.c:6320: error: implicit declaration of function 'rdtscll'
</pre>



<ul>
<li>solution:



<pre class="example">diff --git a/trunk/gtp.c b/trunk/gtp.c
index 4d0c9a2..75c145e 100644
--- a/trunk/gtp.c
+++ b/trunk/gtp.c
@@ -6315,11 +6315,13 @@ gtp_gdbrsp_qtv(char *pkg)
                if (num == GTP_VAR_CLOCK_ID) {
                        val = (uint64_t)GTP_LOCAL_CLOCK;
                        goto output_value;
+#ifdef CONFIG_X86
                } else if (num == GTP_VAR_RDTSC_ID) {
                        unsigned long long a;
                        rdtscll(a);
                        val = (uint64_t)a;
                        goto output_value;
+#endif
                } else if (num == GTP_VAR_XTIME_SEC_ID
                           || num == GTP_VAR_XTIME_NSEC_ID) {
                        struct timespec time
</pre>


</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Complie and Install KGTP </h2>
<div class="outline-text-2" id="text-3">




<pre class="example">make
sudo su
adb push gtp.ko /system/vendor/lib
exit
</pre>




</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> KGTP Running On Android </h2>
<div class="outline-text-2" id="text-4">




<pre class="example">#Open the KGTP interface in current machine.
su
cd /system/vendor/lib
insmod gtp.ko
lsmod
nc -l -p 1234 &lt; /sys/kernel/debug/gtp &gt; /sys/kernel/debug/gtp
</pre>




</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Host PC </h2>
<div class="outline-text-2" id="text-5">




<pre class="example">cd /work/vc1000/src/kernel-vc1000-2.3
make -j8

# symbian use "set gnutarget elf32-littlearm-symbian"
# vxworks use "set gnutarget elf32-littlearm-vxworks"
sudo gdb-release -ex "set gnutarget elf32-littlearm" -ex "file ./vmlinux"

# if you want see the debug info
(gdb) set debug remote 1

# connection your remote device
(gdb) target remote 192.168.2.213:1234

(gdb) trace vfs_readdir
Tracepoint 1 at 0xc02289f0: file /build/buildd/linux-2.6.35/fs/readdir.c, line 23.
(gdb) actions 
Enter actions for tracepoint 1, one per line.
End with a line saying just "end".
&gt;collect $reg
&gt;end
(gdb) tstart 
</pre>




<p>
 <b>Change To Android Device Shell And Run ls Command</b>
</p><ul>
<li>Android Device



<pre class="example">$ ls
</pre>


</li>
</ul>
 <b>Back To Host PC GDB Shell</b>
<ul>
<li>Host PC



<pre class="example">(gdb) shell ls
vmlinux-2.6.35-30-generic
(gdb) tstop 
(gdb) tfind 
Found trace frame 0, tracepoint 1
#0  vfs_readdir (file=0x0, filler=0x163d8ae3, buf=0x18c0) at /build/buildd/linux-2.6.35/fs/readdir.c:23
23      {
</pre>


</li>
</ul>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Good luck, Happy Hacking&hellip; </h2>
<div class="outline-text-2" id="text-6">



</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Very grateful for <a href="http://twitter.com/teawater">teawater</a> </h2>
<div class="outline-text-2" id="text-7">



</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> References </h2>
<div class="outline-text-2" id="text-8">

<ul>
<li><a href="http://code.google.com/p/kgtp/">kgtp Linux Kernel GDB Tracepoint module</a>    
</li>
<li><a href="http://code.google.com/p/kgtp/wiki/Quickstart">kgtp Quick start</a>
</li>
<li><a href="http://code.google.com/p/kgtp/wiki/HOWTO">kgtp How to</a>
</li>
<li><a href="http://sourceware.org/gdb/onlinedocs/gdb/Tracepoints.html#Tracepoints">GDB Tracepoints</a>
</li>
</ul>
</div>
</div>
<div id="postamble">
<p class="author">Author: Bian Jiang</p>
<p class="creator">Org version 7.5 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>
</div>
</div>
</body>
</html>
